VPro/src/ChartsOfAccounts/Managerial/Managerial.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Managerial</name>
  <predefined>
    <items>
      <name>Service</name>
      <description>Service</description>
      <code>00 </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>FixedAssets</name>
      <description>Property</description>
      <code>01 </code>
    </items>
    <items>
      <name>DepreciationFixedAssets</name>
      <description>Depreciation</description>
      <code>02 </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>InvestmentsInFixedAssets</name>
      <description>Attachments in property</description>
      <code>08 </code>
    </items>
    <items>
      <name>RawMaterialsAndMaterials</name>
      <description>Raw materials and materials</description>
      <code>10 </code>
    </items>
    <items>
      <name>UnfinishedProduction</name>
      <description>Goods in production</description>
      <code>20 </code>
    </items>
    <items>
      <name>IndirectExpenses</name>
      <description>Indirect cost</description>
      <code>25 </code>
    </items>
    <items>
      <name>ProductsFinishedProducts</name>
      <description>Goods, products</description>
      <code>41 </code>
    </items>
    <items>
      <name>TradeMarkup</name>
      <description>Trade markup</description>
      <code>42 </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>PettyCash</name>
      <description>PettyCash</description>
      <code>50 </code>
    </items>
    <items>
      <name>Bank</name>
      <description>Bank</description>
      <code>51 </code>
    </items>
    <items>
      <name>TransfersInProcess</name>
      <description>Transfers in process</description>
      <code>57 </code>
    </items>
    <items>
      <name>FinancialInvestments</name>
      <description>Financial investments</description>
      <code>58 </code>
    </items>
    <items>
      <name>AccountsPayableAndContractors</name>
      <description>Settlements with suppliers and contractors</description>
      <code>60 </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>AccountsPayable</name>
        <description>Accounts payable</description>
        <code>60.01 </code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>SettlementsByAdvancesIssued</name>
        <description>Settlements by advances paid</description>
        <code>60.02 </code>
      </childItems>
    </items>
    <items>
      <name>AccountsReceivableAndCustomers</name>
      <description>Settlement with customers and clients</description>
      <code>62 </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>AccountsReceivable</name>
        <description>Accounts receivable</description>
        <code>62.01 </code>
      </childItems>
      <childItems>
        <name>AccountsByAdvancesReceived</name>
        <description>Settlements by advances received</description>
        <code>62.02 </code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>SettlementsByShorttermLoans</name>
      <description>Settlements by short-term loans</description>
      <code>66      </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>AccountsByLongtermLoans</name>
      <description>Settlements by long-term loans</description>
      <code>67      </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>TaxesSettlements</name>
      <description>Tax settlements</description>
      <code>68 </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Taxes</name>
        <description>Taxes</description>
        <code>68.01 </code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>TaxesToRefund</name>
        <description>Taxes to refund</description>
        <code>68.02 </code>
      </childItems>
    </items>
    <items>
      <name>PayrollPaymentsOnPay</name>
      <description>Settlements with personnel for labor payment</description>
      <code>70 </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>SettlementsWithAdvanceHolders</name>
      <description>Settlements with advance holders</description>
      <code>71 </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>AdvanceHolderPayments</name>
        <description>Advances paid to the advance holders</description>
        <code>71.01 </code>
      </childItems>
      <childItems>
        <name>OverrunOfAdvanceHolders</name>
        <description>Overrun of advance holder</description>
        <code>71.02 </code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>StatutoryCapital</name>
      <description>Statutory capital</description>
      <code>80 </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>ReserveAndAdditionalCapital</name>
      <description>Reserve and Additional Capital</description>
      <code>82 </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>UndistributedProfit</name>
      <description>Undistributed profit (uncovered loss)</description>
      <code>84 </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Sales</name>
      <description>Sales</description>
      <code>90 </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>SalesRevenue</name>
        <description>Revenue from sales</description>
        <code>90.01 </code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>CostOfGoodsSold</name>
        <description>Cost of goods sold</description>
        <code>90.02 </code>
      </childItems>
      <childItems>
        <name>CommercialExpenses</name>
        <description>Commercial expenses</description>
        <code>90.07 </code>
      </childItems>
      <childItems>
        <name>AdministrativeExpenses</name>
        <description>Administrative expenses</description>
        <code>90.08 </code>
      </childItems>
    </items>
    <items>
      <name>OtherIncomeAndExpenses</name>
      <description>Other income and expenses</description>
      <code>91 </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>OtherIncome</name>
        <description>Other income</description>
        <code>91.01 </code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>OtherExpenses</name>
        <description>Other expenses</description>
        <code>91.02 </code>
      </childItems>
      <childItems>
        <name>CreditInterestRates</name>
        <description>Credit Interest Rates</description>
        <code>91.03 </code>
      </childItems>
    </items>
    <items>
      <name>DeficiencyAndLossFromPropertySpoilage</name>
      <description>Shortfalls and losses due to impairment of assets</description>
      <code>94 </code>
    </items>
    <items>
      <name>CostsOfFuturePeriods</name>
      <description>Costs of future periods</description>
      <code>97 </code>
    </items>
    <items>
      <name>ProfitsAndLosses</name>
      <description>Profits and losses</description>
      <code>99 </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ProfitsAndLossesWithoutProfitTax</name>
        <description>Profits and losses (excluding the profits tax)</description>
        <code>99.01 </code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ProfitsAndLosses_ProfitTax</name>
        <description>Income tax</description>
        <code>99.02 </code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
  </predefined>
  <attributes>
    <name>TypeOfAccount</name>
    <type>
      <types>EnumRef.GLAccountsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>MethodOfDistribution</name>
    <type>
      <types>EnumRef.CostingBases</types>
    </type>
  </attributes>
  <attributes>
    <name>ClosingAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <tabularSections>
    <name>GLAccounts</name>
    <attributes>
      <name>GLAccount</name>
      <type>
        <types>ChartOfAccountsRef.Managerial</types>
      </type>
    </attributes>
  </tabularSections>
  <accountingFlags>
    <name>Currency</name>
    <comment>Currency</comment>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
</mdclass:ChartOfAccounts>

VPro/src/Enums/GLAccountsTypes/GLAccountsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>GLAccountsTypes</name>
  <enumValues>
    <name>DepreciationFixedAssets</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>FixedAssets</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>AccountsGroup</name>
    <comment>Service</comment>
  </enumValues>
  <enumValues>
    <name>Debitors</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>CashAssets</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>LongtermObligations</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Incomings</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Inventory</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Capital</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>IndirectExpenses</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>ShorttermInvestments</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Creditors</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>Loans</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>ProfitTax</name>
  </enumValues>
  <enumValues>
    <name>UnfinishedProduction</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>UndistributedProfit</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ProfitLosses</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>LoanInterest</name>
  </enumValues>
  <enumValues>
    <name>OtherFixedAssets</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>OtherIncome</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>OtherShorttermObligations</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>OtherCurrentAssets</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>OtherExpenses</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Expenses</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>ReserveAndAdditionalCapital</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>CostOfGoodsSold</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>TradeMarkup</name>
  </enumValues>
</mdclass:Enum>

VPro/src/ChartsOfAccounts/Managerial/Forms/ChoiceFormSimple/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FilterItem = List.SettingsComposer.FixedSettings.Filter.Items.Add(Type("DataCompositionFilterItem"));
	FilterItem.LeftValue = New DataCompositionField("Ref");
	FilterItem.ComparisonType = DataCompositionComparisonType.Equal;
	FilterItem.Use = True;
	
	IncludeCostOfOther = False;
	IncludeInIncomeOther = False;
	
	// To display other expenses together with the principal expenses.
	If Parameters.Property("IncludeCostOfOther") Then
		IncludeCostOfOther = Parameters.IncludeCostOfOther;
	EndIf;
	
	// To display other income together with the principal one.
	If Parameters.Property("IncludeInIncomeOther") Then
		IncludeInIncomeOther = Parameters.IncludeInIncomeOther;
	EndIf;
	
	// To change the form header.
	If Parameters.Property("InvoiceHeader") Then
		Title = Parameters.InvoiceHeader;
	EndIf;
	
	// To change the form header.
	If Parameters.Property("ExcludePredefinedAccount") Then
		ExcludePredefinedAccount = Parameters.ExcludePredefinedAccount;
	EndIf;
	
	If Parameters.Property("CurrentRow")
	   AND ValueIsFilled(Parameters.CurrentRow)
	   AND TypeOf(Parameters.CurrentRow) = Type("ChartOfAccountsRef.Managerial")
	   AND Parameters.Property("Filter")
	   AND Parameters.Filter.Property("TypeOfAccount") Then // if the account is already selected.
		AddHierarchy(Parameters.Filter.TypeOfAccount, Parameters.CurrentRow.TypeOfAccount);
		FilterItem.RightValue = Parameters.CurrentRow; // to exclude blinking at filter setting.
	ElsIf Parameters.Property("Filter")
			AND Parameters.Filter.Property("TypeOfAccount") Then // if the account isn't selected.
		AddHierarchy(Parameters.Filter.TypeOfAccount);
		FilterItem.RightValue = ChartsOfAccounts.Managerial.EmptyRef(); // to exclude blinking at filter setting.
	Else
		AddHierarchy();
		FilterItem.RightValue = ChartsOfAccounts.Managerial.EmptyRef();
	EndIf;
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	Items.Hierarchy.CurrentRow = CurHierarchyRow;
	
EndProcedure

#EndRegion

#Region FormItemsEventsHandlers

&AtClient
Procedure HierarchyOnActivateRow(Item)
	
	If Items.Hierarchy.CurrentData <> Undefined
	   AND CurHierarchy <> Items.Hierarchy.CurrentData.Value Then
		SetFilterOnClient(Items.Hierarchy.CurrentData.Value);
		CurHierarchy = Items.Hierarchy.CurrentData.Value;
	EndIf;
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtServer
Procedure AddHierarchy(GLAccountsTypes = Undefined, TypeOfAccount = Undefined)
	
	UseSubsystemProduction = Constants.FunctionalOptionUseSubsystemProduction.Get();
	
	Ct = 0;
	CurHierarchyRow = 0;
	
	If TypeOf(GLAccountsTypes) = Type("FixedArray") Then
		For Each CurAccountType IN GLAccountsTypes Do
			InvoiceHeader = "";
			If CurAccountType = Enums.GLAccountsTypes.Expenses Then
				InvoiceHeader = NStr("en='Expenses allocated to the financial result (Indirect)';ru='Расходы, распределяемые на финансовый результат (Косвенные)';vi='Chi phí được phân bổ theo kết quả hoạt động kinh doanh (Gián tiếp)'");
			ElsIf CurAccountType = Enums.GLAccountsTypes.OtherExpenses Then
				InvoiceHeader = NStr("en='Other expenses allocated to the financial result';ru='Прочие расходы, распределяемые на финансовый результат';vi='Chi khác được phân bổ theo kết quả kinh doanh'");
			ElsIf  CurAccountType = Enums.GLAccountsTypes.Incomings Then
				InvoiceHeader = NStr("en='Income allocated to the financial result';ru='Доходы, распределяемые на финансовый результат';vi='Thu nhập được phân bổ cho kết quả kinh doanh'");
			ElsIf CurAccountType = Enums.GLAccountsTypes.OtherIncome Then
				InvoiceHeader = NStr("en='Other income allocated to the financial result';ru='Прочие доходы, распределяемые на финансовый результат';vi='Thu nhập khác được phân bổ theo kết quả kinh doanh'");
			ElsIf CurAccountType = Enums.GLAccountsTypes.Debitors Then
				InvoiceHeader = NStr("en='Other debtors (debt to us)';ru='Прочие дебиторы (задолженность перед нами)';vi='Nợ phải thu khác'");
			ElsIf CurAccountType = Enums.GLAccountsTypes.Creditors Then
				InvoiceHeader = NStr("en='Other creditors (our debt)';ru='Прочие кредиторы (наша задолженность)';vi='Nợ phải trả khác'");
			ElsIf CurAccountType = Enums.GLAccountsTypes.CashAssets Then
				InvoiceHeader = NStr("en='Funds transfer';ru='Перемещения денег';vi='Chuyển tiền nội bộ'");
			ElsIf CurAccountType = Enums.GLAccountsTypes.LongtermObligations Then
				InvoiceHeader = NStr("en='Long-term liabilities';ru='Долгосрочные обязательства';vi='Phải trả dài hạn'");
			ElsIf CurAccountType = Enums.GLAccountsTypes.Capital Then
				InvoiceHeader = NStr("en='Capital';ru='Капитал';vi='Vốn'");
			ElsIf CurAccountType = Enums.GLAccountsTypes.Loans Then
				InvoiceHeader = NStr("en='Credits and Loans';ru='Кредиты и займы';vi='Vay và cho vay'");
			ElsIf CurAccountType = Enums.GLAccountsTypes.UnfinishedProduction Then
				InvoiceHeader = NStr("en='Expenses related to product release (Direct)';ru='Затраты, относящиеся к выпуску продукции (Прямые)';vi='Chi phí liên quan đến việc xuất xưởng thành phẩm (Trực tiếp)'");
			ElsIf CurAccountType = Enums.GLAccountsTypes.IndirectExpenses Then
				InvoiceHeader = NStr("en='Costs allocated to product release cost (Indirect)';ru='Затраты, распределяемые на себестоимость выпуска продукции (Косвенные)';vi='Chi phí được phân bổ cho giá thành xuất xưởng thành phẩm (Gián tiếp)'");
			ElsIf CurAccountType = Enums.GLAccountsTypes.OtherCurrentAssets Then
				InvoiceHeader = NStr("en='Other Current Assets';ru='Прочие оборотные активы';vi='Tài sản ngắn hạn khác'");
			EndIf;
			If (UseSubsystemProduction
				  OR (CurAccountType <> Enums.GLAccountsTypes.UnfinishedProduction
					   AND CurAccountType <> Enums.GLAccountsTypes.IndirectExpenses))
			   AND (NOT IncludeCostOfOther
				  OR (IncludeCostOfOther
					   AND CurAccountType <> Enums.GLAccountsTypes.OtherExpenses))
			   AND (NOT IncludeInIncomeOther
				  OR (IncludeInIncomeOther
					   AND CurAccountType <> Enums.GLAccountsTypes.OtherIncome)) Then // adding hierarchy if the filter corresponds to conditions.
				Hierarchy.Add(CurAccountType, InvoiceHeader);
				If CurAccountType = TypeOfAccount
					OR (IncludeCostOfOther AND TypeOfAccount = Enums.GLAccountsTypes.OtherExpenses AND CurAccountType = Enums.GLAccountsTypes.Expenses)
					OR (IncludeInIncomeOther AND TypeOfAccount = Enums.GLAccountsTypes.OtherIncome AND CurAccountType = Enums.GLAccountsTypes.Incomings) Then
					CurHierarchyRow = Ct;
				EndIf;
				Ct = Ct + 1;
			EndIf;
		EndDo;
	ElsIf ValueIsFilled(GLAccountsTypes) Then
		Hierarchy.Add(GLAccountsTypes);
		CurHierarchyRow = 0;
	Else
		For Ct = 0 To Enums.GLAccountsTypes.Count() - 1 Do
			Hierarchy.Add(Enums.GLAccountsTypes[Ct]);
		EndDo;
		CurHierarchyRow = 0;
	EndIf;
	
	For Ct = 0 To Hierarchy.Count() - 1 Do
		Hierarchy[Ct].Picture = PictureLib.Folder;
	EndDo;
	
EndProcedure

&AtClient
Procedure SetFilterOnClient(TypeOfAccount = Undefined)
	
	List.SettingsComposer.FixedSettings.Filter.Items.Clear();
	
	If ExcludePredefinedAccount Then
		
		FilterList = New ValueList(); // Accounts matching accumulation registers shall be excluded from the filter for other operations.
		FilterList.Add(PredefinedValue("ChartOfAccounts.Managerial.Bank"));
		FilterList.Add(PredefinedValue("ChartOfAccounts.Managerial.PettyCash"));
		FilterList.Add(PredefinedValue("ChartOfAccounts.Managerial.Taxes"));
		FilterList.Add(PredefinedValue("ChartOfAccounts.Managerial.TaxesToRefund"));
		FilterList.Add(PredefinedValue("ChartOfAccounts.Managerial.SettlementsByAdvancesIssued"));
		FilterList.Add(PredefinedValue("ChartOfAccounts.Managerial.AccountsByAdvancesReceived"));
		FilterList.Add(PredefinedValue("ChartOfAccounts.Managerial.AccountsReceivable"));
		FilterList.Add(PredefinedValue("ChartOfAccounts.Managerial.AccountsPayable"));
		FilterList.Add(PredefinedValue("ChartOfAccounts.Managerial.AdvanceHolderPayments"));
		FilterList.Add(PredefinedValue("ChartOfAccounts.Managerial.OverrunOfAdvanceHolders"));
		FilterList.Add(PredefinedValue("ChartOfAccounts.Managerial.PayrollPaymentsOnPay"));
		
		FilterItem = List.SettingsComposer.FixedSettings.Filter.Items.Add(Type("DataCompositionFilterItem"));
		FilterItem.LeftValue = New DataCompositionField("Ref");
		FilterItem.ComparisonType = DataCompositionComparisonType.NotInList;
		FilterItem.Use = True;
		FilterItem.RightValue = FilterList;
		
	EndIf;
	
	If ValueIsFilled(TypeOfAccount) Then
		
		FilterItem = List.SettingsComposer.FixedSettings.Filter.Items.Add(Type("DataCompositionFilterItem"));
		FilterItem.LeftValue = New DataCompositionField("TypeOfAccount");
		FilterItem.ComparisonType = DataCompositionComparisonType.Equal;
		FilterItem.Use = True;
		
		If TypeOfAccount = PredefinedValue("Enum.GLAccountsTypes.Expenses")
		   AND IncludeCostOfOther = True Then
			FilterList = New ValueList();
			FilterList.Add(PredefinedValue("Enum.GLAccountsTypes.Expenses"));
			FilterList.Add(PredefinedValue("Enum.GLAccountsTypes.OtherExpenses"));
			FilterItem.ComparisonType = DataCompositionComparisonType.InList;
			FilterItem.RightValue = FilterList;
		ElsIf TypeOfAccount = PredefinedValue("Enum.GLAccountsTypes.Incomings")
		   AND IncludeInIncomeOther = True Then
			FilterList = New ValueList();
			FilterList.Add(PredefinedValue("Enum.GLAccountsTypes.Incomings"));
			FilterList.Add(PredefinedValue("Enum.GLAccountsTypes.OtherIncome"));
			FilterItem.ComparisonType = DataCompositionComparisonType.InList;
			FilterItem.RightValue = FilterList;
		Else
			FilterItem.RightValue = TypeOfAccount;
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion
